package com.example.artspace

data class ImageData(val title: String, val author: String, val year: Int, val imageRes: Int)

val images = listOf(
    /* #0 */ //ImageData("Сатурн, пожирающий сына", "Гойя", 1819, R.drawable._125136),
    /* #1 */ ImageData("1 круг Ада: Лимб", "Гюстав Доре. Лимб", 1857, R.drawable.__1),
    /* #2 */ ImageData("2 круг Ада: Похоть", "Гюстав Доре. Франческа да Римини и Паоло Малатеста", 1857, R.drawable.__2),
    /* #3 */ ImageData("3 круг Ада: Чревоугодие", "Гюстав Доре. Цербер терзает чревоугодников", 1857, R.drawable.__3),
    /* #4 */ ImageData("4 круг Ада: Скупость и расточительство", "Гюстав Доре. Скупые и расточители", 1857, R.drawable.__4),
    /* #5 */ ImageData("5 круг Ада: Гнев и праздность", "Гюстав Доре. Гневные в Стиксе", 1857, R.drawable.__5),
    /* #6 */ ImageData("6 круг Ада: Еретики", "Гюстав Доре. Еретики в горящих гробницах", 1857, R.drawable.__6),
    /* #7 */ ImageData("7 круг Ада: Насилие", "Гюстав Доре. Лес самоубийц", 1857, R.drawable.__7),
    /* #8 */ ImageData("8 круг Ада: Обманщики", "Гюстав Доре. Наказание симонистов", 1857, R.drawable.__8),
    /* #9 */ ImageData("9 круг Ада: Предатели", "Гюстав Доре. Сатана в ледяном озере", 1857, R.drawable.__9),
)
